## Create a database with sqlite3

In [67]:
import sqlite3

conn = sqlite3.connect("javatpoint.db")

print("Opened database successfully")

Opened database successfully

In [68]:
import sqlite3

conn = sqlite3.connect("javatpoint.db")
print("Opened database successfully")

conn.execute(
    """CREATE TABLE Employees 
    (Id INT PRIMARY KEY     NOT NULL, 
    Name           TEXT    NOT NULL, 
    Age            INT     NOT NULL, 
    Address        CHAR(50), 
    Salary         REAL);"""
)
print("Table created successfully")

conn.close()

Opened database successfully
Table created successfully

In [69]:
conn = sqlite3.connect("javatpoint.db")
print("Opened database successfully")

conn.execute(
    """INSERT INTO Employees (ID,NAME,AGE,ADDRESS,SALARY) VALUES (1, 'Ajeet', 27, 'Delhi', 20000.00 )"""
)

conn.execute(
    """INSERT INTO Employees (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Allen', 22, 'London', 25000.00 )"""
)

conn.execute(
    """INSERT INTO Employees (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Mark', 29, 'CA', 200000.00 )"""
)

conn.execute(
    """INSERT INTO Employees (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Kanchan', 22, 'Ghaziabad ', 65000.00 )"""
)

conn.commit()
print("Records inserted successfully")
conn.close()

Opened database successfully
Records inserted successfully

In [70]:
conn = sqlite3.connect("javatpoint.db")
print("Opened database successfully")

result = conn.execute("""SELECT * FROM Employees""")
print(result.fetchall())

conn.close()

Opened database successfully
[(1, 'Ajeet', 27, 'Delhi', 20000.0), (2, 'Allen', 22, 'London', 25000.0), (3, 'Mark', 29, 'CA', 200000.0), (4, 'Kanchan', 22, 'Ghaziabad ', 65000.0)]

In [71]:
conn = sqlite3.connect("javatpoint.db")
print("Opened database successfully")

query = """SELECT * FROM Employees WHERE SALARY >= 65000 AND AGE <= 25"""
result = conn.execute(query)
print(result.fetchall())

Opened database successfully
[(4, 'Kanchan', 22, 'Ghaziabad ', 65000.0)]

In [76]:
query = """SELECT * FROM Employees WHERE ADDRESS = "London" """
result = conn.execute(query)
print(result.fetchall())

[(2, 'Allen', 22, 'London', 25000.0)]

## Parsing SQL

In [2]:
import sqlparse
import sqlvalidator

sql = """SELECT MAX(Share), MIN(Share) FROM performance WHERE Type != \"Live final\""""

sql_query = sqlvalidator.parse(sql)

In [52]:
sql = """SELECT Name FROM Students S WHERE S.Name = \"John\""""

parsed = sqlparse.parse(sql)[0]
print(parsed.tokens)

identifiers = []
identifier_lists = []
where_lists = []

for token in parsed.tokens:
    print(type(token), f'The token is: "{token}"')
    if type(token) == sqlparse.sql.IdentifierList:
        identifier_lists.append(token)
    elif type(token) == sqlparse.sql.Where:
        where_lists.append(token)
    elif type(token) == sqlparse.sql.Identifier:
        identifiers.append(token)

[<DML 'SELECT' at 0x116053820>, <Whitespace ' ' at 0x106F00940>, <Identifier 'Name' at 0x106F2CAC0>, <Whitespace ' ' at 0x106F00AC0>, <Keyword 'FROM' at 0x106F00820>, <Whitespace ' ' at 0x106F00760>, <Identifier 'Studen...' at 0x106F2CB30>, <Whitespace ' ' at 0x106F005E0>, <Where 'WHERE ...' at 0x106F2C970>]
<class 'sqlparse.sql.Token'> The token is: "SELECT"
<class 'sqlparse.sql.Token'> The token is: " "
<class 'sqlparse.sql.Identifier'> The token is: "Name"
<class 'sqlparse.sql.Token'> The token is: " "
<class 'sqlparse.sql.Token'> The token is: "FROM"
<class 'sqlparse.sql.Token'> The token is: " "
<class 'sqlparse.sql.Identifier'> The token is: "Students S"
<class 'sqlparse.sql.Token'> The token is: " "
<class 'sqlparse.sql.Where'> The token is: "WHERE S.Name = "John""

In [53]:
for identifier_list in identifier_lists:
    for identifier in identifier_list.get_identifiers():
        print(type(identifier), f'The identifier is: "{identifier}"')

In [54]:
for token in where_lists[0].tokens:
    print(type(token), f'The token is: "{token}"')

<class 'sqlparse.sql.Token'> The token is: "WHERE"
<class 'sqlparse.sql.Token'> The token is: " "
<class 'sqlparse.sql.Comparison'> The token is: "S.Name = "John""

In [55]:
where_lists[0].tokens[2].tokens

[<Identifier 'S.Name' at 0x106F2CA50>,
 <Whitespace ' ' at 0x106F00280>,
 <Comparison '=' at 0x106F00340>,
 <Whitespace ' ' at 0x106F002E0>,
 <Identifier '"John"' at 0x106F2C9E0>]

In [51]:
# case 1
"""SELECT * FROM Students WHERE "First name" = 'Last name' """

# case 2
"""SELECT * FROM Students WHERE "First name" = "John" """
"""SELECT * FROM Students WHERE "First name" = 'John' """

# case 3
"""SELECT * FROM Students WHERE "John" = "First name" """

'SELECT * FROM Students WHERE "First name" = "Last name"'